# coding:utf-8
# _author_:Junjie
# date:2018/10/18
import pickle
import re
import time

import requests
from config import command_head
import json

from get_image import func


def remove_symbol(string):
    string = re.sub(u"[\s+\.\!\/_,$%^*(+\"\')\]+\|\[+—\-()?【】“”！，。？、~@#￥%……&*（）：=]", "", string)
    return string


def get_weight(words):
    weight = 1 / words[0][1]
    result = []
    for word in words:
        result.append((word[0], word[1] * weight))
    return result


def create_task(list1, list2):
    result = []
    for i in list1:
        for j in list2:
            result.append(str(i) + ' ' + str(j[0]))
    return result


def create_key_word(word, list1):
    result = []
    if list1 == []:
        result.append(word)
    elif len(list1) < 10:
        for i in list1:
            result.append(word + ' ' + str(i[0]))
        return result
    else:  # 如果核心描述中的词汇比较多，则以其中两两组合作为固有出现，构造固有出现词组集合
        j = 1
        words = word
        for i in list1:
            if j < 2:
                words += ' ' + str(i[0])
                j += 1
            else:
                words += ' ' + str(i[0])
                result.append(words)
                words = word
                j = 1
    return result


def mkdir(path):
    import os
    path = path.strip()
    path = path.rstrip("\\")
    isExists = os.path.exists(path)
    if not isExists:
        os.makedirs(path)
        return True
    else:
        return False


def search1(key_word):
    # key_sentece = remove_symbol(key_sentece)
    # keys = jieba.cut(key_sentece) # 处理核心描述
    # key_words = []
    # for key in keys:
    #     key_words.append((key, 1))
    # # print(key_words)
    #
    # more_sentence = remove_symbol(more_sentence)  # 处理扩展描述
    # keys = jieba.cut(more_sentence)
    # key_words2 = []
    # for key in keys:
    #     key_words2.append(key)
    #
    # cnt2 = Counter()
    # for word in key_words2:
    #     cnt2[word] += 1
    # # print(cnt2.most_common())
    # words2 = get_weight(cnt2.most_common())  # 对扩展描述切词后，统计词频，针对词频的数字，对词的权重进行分级，
    # # print(words2)
    # words = create_key_word(key_word,key_words)  # 组合核心词汇与核心描述
    # task = create_task(words,words2)  # 将每一个可选出现的扩展描述词汇与固有出现词组 搭配，形成搜索关键词，
    # print(task)
    task = [key_word]  # 暂时用这个简化的语句代替上面的对多个输入的预处理代码
    print('task in search is :' + str(task))

    # destinip = '106.15.177.58'
    # destinip = '192.168.3.210'
    destinip = '192.168.3.32'
    # destinip = '127.0.0.1'
    destinport = '9000'
    # for t in task:
    info = {'head': command_head['send_search2_task'], 'search_word': str(task), 'destinip': destinip,
            'destinport': destinport}
    r = requests.post("http://127.0.0.1:9200/set_task", data=info)  # 指令节点发送任务
    response = json.loads(r.text)
    print(response)
    result = []
    if response['head'] == command_head['response_search2_task']:
        task_id = response['task_id']
        while True:
            try:
                info = {'head': command_head['take_search2_result'], 'task_id': task_id}
                print('ask for result by command node')
                r = requests.post("http://127.0.0.1:9200/take_final_result", data=info)
                response = json.loads(r.text)
                print('result received by command node')
                if response['head'] == command_head['final_search2_result']:  # 获取搜索结果

                    result = eval(response['result'])  # 去重
                    print('effective result received !!!!!!!!!!!!!')
                    print(result)

                    break
            except Exception as e:
                pass
            time.sleep(10)
    time.sleep(60)

    return result


def deal_relation(data):
    relation = {'data': {'nodes': [], 'relationships': []}}
    node_id = 1
    rela_id = 1000
    node = {}
    data = data[0]
    for i in data:
        if not i:
            continue
        i = i[0]
        if not i:
            continue
        if i[0] == i[2]:
            continue
        if i[0] not in node:
            relation['data']['nodes'].append(
                {'id': str(node_id), 'labels': ['item'], 'properties': {'logo': '', 'name': i[0], 'ntype': 'f'}})
            node[i[0]] = node_id
            node_id += 1
        if i[2] not in node:
            relation['data']['nodes'].append(
                {'id': str(node_id), 'labels': ['item'], 'properties': {'logo': '', 'name': i[2], 'ntype': 'f'}})
            node[i[2]] = node_id
            node_id += 1
        relation['data']['relationships'].append(
            {'id': str(rela_id), 'startNode': str(node[i[0]]), 'endNode': str(node[i[2]]),
             'properties': {'labels': [i[1]]}, 'type': 'BRANCH'})
        rela_id += 1
    print(relation)
    return relation


if __name__ == '__main__':
    # key_word = '刘强东 性侵'  # 搜索中必定要有的核心词汇
    # search1(key_word)
    # words = ['任正非', '巴龙', '海思', '何庭波', '小枣君', '麒麟', '余承东', 'SD58XX', 'AP', 'Cortex-A9', 'P6', 'IC', 'xzclasscom', 'Modem', 'Mate7', 'CPU', 'Qualcomm', 'Application-specific integrated circuit', 'Mate', 'A4', 'WCDMA', 'P8', 'fab', 'NE5000E-X16A', 'IP', 'ID', 'SILICON', 'BP', 'Fabless', 'ASIC', 'Mali-450', 'Foundry', 'GSM', 'RF', 'P7', 'C08', 'CDMA2000', 'Integrated Design and Manufacture', 'GPU', 'iPhone4', 'IT', 'ARM', 'LTE', 'HUAWEI-SILICON', 'K3', 'HI-SILICON', 'P20', 'Kirin', 'Intel', 'Balong710', 'System-on-a-Chip', 'CDMA', 'K3V2', 'IDM', 'SoC', 'Intellectual Property', '深圳市', '中国', '华为海思内部', '联发科', '深圳市海思半导体有限公司', '高通', '华为', '台积电', '华为海思', '中央处理器芯片', '英特尔', '设计中心']
    #
    # words_detail = [(1857, (
    # {'任正非': (0.75, 1), '巴龙': (0.5, 2), '海思': (0.5, 6), '何庭波': (0.75, 2), '小枣君': (0.75, 3), '麒麟': (0.5, 4),
    #  '余承东': (0.75, 1)}, {},
    # {'SD58XX': (1.5, 2), 'AP': (0.5, 2), 'Cortex-A9': (2.25, 2), 'P6': (0.5, 4), 'IC': (0.5, 2), 'xzclasscom': (2.5, 2),
    #  'Modem': (1.25, 2), 'Mate7': (1.25, 2), 'CPU': (0.75, 4), 'Qualcomm': (2.0, 2),
    #  'Application-specific integrated circuit': (9.75, 1), 'Mate': (1.0, 4), 'A4': (0.5, 2), 'WCDMA': (1.25, 4),
    #  'P8': (0.5, 2), 'fab': (0.75, 3), 'NE5000E-X16A': (3.0, 2), 'IP': (0.5, 2), 'ID': (0.5, 2), 'SILICON': (1.75, 3),
    #  'BP': (0.5, 2), 'Fabless': (1.75, 8), 'ASIC': (1.0, 10), 'Mali-450': (2.0, 2), 'Foundry': (1.75, 4),
    #  'GSM': (0.75, 2), 'RF': (0.5, 2), 'P7': (0.5, 2), 'C08': (0.75, 2), 'CDMA2000': (2.0, 2),
    #  'Integrated Design and Manufacture': (8.25, 2), 'GPU': (0.75, 4), 'iPhone4': (1.75, 2), 'IT': (0.5, 2),
    #  'ARM': (0.75, 31), 'LTE': (0.75, 2), 'HUAWEI-SILICON': (3.5, 2), 'K3': (0.5, 2), 'HI-SILICON': (2.5, 2),
    #  'P20': (0.75, 4), 'Kirin': (1.25, 2), 'Intel': (1.25, 2), 'Balong710': (2.25, 2), 'System-on-a-Chip': (4.0, 2),
    #  'CDMA': (1.0, 3), 'K3V2': (1.0, 6), 'IDM': (0.75, 5), 'SoC': (0.75, 12), 'Intellectual Property': (5.25, 2)},
    # ['深圳市', '中国'],
    # {'华为海思内部': (1.5, 1), '联发科': (0.75, 1), '深圳市海思半导体有限公司': (3.0, 1), '高通': (0.5, 5), '华为': (0.5, 60), '台积电': (0.75, 4),
    #  '华为海思': (1.0, 22), '中央处理器芯片': (1.75, 2), '英特尔': (0.75, 4), '设计中心': (1.0, 1)})), (1780, (
    # {'海思': (0.5, 10), '杨元庆': (0.75, 2), '零抽成': (0.75, 1), '凌霄': (0.5, 3), '卡顿': (0.5, 1), '布斯': (0.5, 1),
    #  '刘强': (0.5, 2), '何庭波': (0.75, 3), '高通': (0.5, 32), '赵何娟': (0.75, 1), '高冬梅': (0.75, 1), '吴晓波': (0.75, 2),
    #  '任正非': (0.75, 10), '徐直军': (0.75, 1), '巴龙': (0.5, 3), '小海思': (0.75, 4), '刘静尧': (0.75, 2)},
    # {'华为旗下': (1.0, 1), '达芬奇': (0.75, 1), '海思自研': (1.0, 1), '创事记': (0.75, 2)},
    # {'K3V1': (1.0, 2), 'Hi563x': (1.5, 2), 'IC': (0.5, 4), 'WiFi': (1.0, 4), 'SINA EnglishCopyright': (5.25, 2),
    #  'Application-specific integrated circuit': (9.75, 1), 'MTK': (0.75, 4), 'DVB': (0.75, 2), 'NVR SoC': (1.75, 2),
    #  'A4': (0.5, 2), 'IP': (0.5, 4), 'GTI': (0.75, 2), 'AI': (0.5, 2), 'DLive08': (1.75, 2), 'Fabless': (1.75, 6),
    #  'ASIC': (1.0, 6), 'IPO07YouTube': (3.0, 2), 'Q2 Pro': (1.5, 1), 'App': (0.75, 2), 'C08': (0.75, 2),
    #  'DSP': (0.75, 2), 'MWC': (0.75, 2), 'Integrated Design and Manufacture': (8.25, 2), 'GPU': (0.75, 4),
    #  'libusiness': (2.5, 2), 'Windows Mobile': (3.5, 2), 'About Sina': (2.5, 2), 'Android Authority': (4.25, 2),
    #  'ARM': (0.75, 24), 'vivo': (1.0, 3), 'DLive': (1.25, 2), 'Arm PC': (1.5, 2), 'IPC SoC': (1.75, 2),
    #  'LTE Cat.11': (2.5, 1), 'K3V2': (1.0, 6), 'IDM': (0.75, 6), 'USB': (0.75, 2), 'OMAP': (1.0, 2), 'Hi565x': (1.5, 2),
    #  'WS5200': (1.5, 2), 'P6': (0.5, 2), 'P9': (0.5, 2), 'CPU': (0.75, 14), 'Qualcomm': (2.0, 2), 'YouTube': (1.75, 2),
    #  'IPTV': (1.0, 2), 'EDA': (0.75, 4), 'Mate': (1.0, 4), '3G': (0.5, 2), 'SK': (0.5, 6), 'ID': (0.5, 2),
    #  'Baseband': (2.0, 2), 'Boudica': (1.75, 2), 'DVR SoC': (1.75, 2), 'Foundry': (1.75, 4), 'Pro': (0.75, 5),
    #  'sinachuangshiji': (3.75, 2), 'PC': (0.5, 3), 'IPO': (0.75, 3), 'AWE': (0.75, 2),
    #  'SINA CorporationAll Rights Reserved': (8.75, 2), 'Gartner': (1.75, 2), 'iPhone4': (1.75, 2), 'IoT': (0.75, 4),
    #  'SSD': (0.75, 2), 'NB-IoT': (1.5, 4), 'PLC Turbo': (2.25, 2), 'K3': (0.5, 4), 'DVR': (0.75, 3), 'arm': (0.75, 3),
    #  'PK': (0.5, 2), 'OPPO': (1.0, 3), 'ISP': (0.75, 4), 'SoC': (0.75, 14), 'mate9': (1.25, 2)},
    # ['中国台湾', '江苏南京', '明尼苏达', '深圳市', '意大利', '美国', '法国', '亚洲', '德州', '欧洲', '上海', '重庆', '安卓', '韩国', '麒麟', '安霸', '福建'],
    # {'新浪': (0.5, 3), '德州仪器': (1.0, 3), '中央研究部': (1.25, 2), '联发科': (0.75, 3), '大华股份': (1.0, 2), '华为实验室': (1.25, 1),
    #  '中兴集成电路': (1.5, 1), '华为麒麟': (1.0, 2), '中兴之间': (1.0, 1), '华为': (0.5, 129), '新浪科技': (1.0, 1), '英伟达': (0.75, 2),
    #  '三星': (0.5, 12), '韩国三星': (1.0, 1), '华为芯片': (1.0, 1), '华为终端公司': (1.5, 1), '深圳市海思半导体有限公司': (3.0, 1),
    #  '联想集团': (1.0, 1), '中兴': (0.5, 15), '海力士': (0.75, 1), '华为子母': (1.0, 1), '中国公司': (1.0, 1), '中兴差': (0.75, 1),
    #  '台积电': (0.75, 11), '华为海思': (1.0, 6), '海康威视': (1.0, 1), '三星电子': (1.0, 2), '英特尔': (0.75, 16), '芯片': (0.5, 2),
    #  '新浪公司': (1.0, 1), '设计中心': (1.0, 1)})), (1781, (
    # {'任正非': (0.75, 10), '何庭波': (0.75, 3), '巴龙': (0.5, 3), '海思': (0.5, 10), '徐直军': (0.75, 1), '凌霄': (0.5, 3),
    #  '卡顿': (0.5, 1), '小海思': (0.75, 4), '高通': (0.5, 32), '高冬梅': (0.75, 2)},
    # {'华为旗下': (1.0, 1), '达芬奇': (0.75, 1), '文中兴': (0.75, 2), '海思自研': (1.0, 1)},
    # {'WS5200': (1.5, 2), 'P6': (0.5, 2), 'Hi563x': (1.5, 2), 'IC': (0.5, 4), 'K3V1': (1.0, 2), 'WiFi': (1.0, 4),
    #  'P9': (0.5, 2), 'CPU': (0.75, 14), 'Qualcomm': (2.0, 2), 'Application-specific integrated circuit': (9.75, 1),
    #  'MTK': (0.75, 4), 'DVB': (0.75, 2), 'IPTV': (1.0, 2), 'NVR SoC': (1.75, 2), 'Mate': (1.0, 4), 'A4': (0.5, 2),
    #  '3G': (0.5, 2), 'EDA': (0.75, 4), 'GTI': (0.75, 2), 'USB': (0.75, 2), 'IP': (0.5, 4), 'SK': (0.5, 6),
    #  'Baseband': (2.0, 2), 'AI': (0.5, 2), 'Boudica': (1.75, 2), 'DVR SoC': (1.75, 2), 'ASIC': (1.0, 6),
    #  'Fabless': (1.75, 6), 'Pro': (0.75, 5), 'Foundry': (1.75, 4), 'Q2 Pro': (1.5, 1), 'C08': (0.75, 2),
    #  'DSP': (0.75, 2), 'MWC': (0.75, 2), 'AWE': (0.75, 2), 'Integrated Design and Manufacture': (8.25, 2),
    #  'Gartner': (1.75, 2), 'GPU': (0.75, 4), 'iPhone4': (1.75, 2), 'IoT': (0.75, 4), 'SSD': (0.75, 2),
    #  'Windows Mobile': (3.5, 2), 'NB-IoT': (1.5, 4), 'Android Authority': (4.25, 2), 'ARM': (0.75, 24),
    #  'PLC Turbo': (2.25, 2), 'vivo': (1.0, 3), 'K3': (0.5, 4), 'Arm PC': (1.5, 2), 'DVR': (0.75, 3),
    #  'IPC SoC': (1.75, 2), 'arm': (0.75, 3), 'PK': (0.5, 2), 'LTE Cat.11': (2.5, 1), 'OPPO': (1.0, 3), 'K3V2': (1.0, 6),
    #  'IDM': (0.75, 6), 'ISP': (0.75, 4), 'SoC': (0.75, 14), 'OMAP': (1.0, 2), 'mate9': (1.25, 2), 'Hi565x': (1.5, 2)},
    # ['中国台湾', '意大利', '深圳市', '美国', '法国', '安霸', '亚洲', '上海', '欧洲', '安卓', '韩国', '麒麟', '德州'],
    # {'德州仪器': (1.0, 3), '中央研究部': (1.25, 2), '联发科': (0.75, 3), '大华股份': (1.0, 2), '华为实验室': (1.25, 1), '中兴集成电路': (1.5, 1),
    #  '华为麒麟': (1.0, 2), '中兴之间': (1.0, 1), '华为': (0.5, 130), '英伟达': (0.75, 2), '三星': (0.5, 12), '韩国三星': (1.0, 1),
    #  '华为芯片': (1.0, 1), '华为终端公司': (1.5, 1), '深圳市海思半导体有限公司': (3.0, 1), '中兴': (0.5, 12), '海力士': (0.75, 1),
    #  '华为子母': (1.0, 1), '中国公司': (1.0, 1), '台积电': (0.75, 11), '华为海思': (1.0, 6), '海康威视': (1.0, 1), '三星电子': (1.0, 2),
    #  '英特尔': (0.75, 16), '芯片': (0.5, 2), '设计中心': (1.0, 1)})), (1786, (
    # {'任正非': (0.75, 10), '何庭波': (0.75, 3), '巴龙': (0.5, 3), '海思': (0.5, 10), '徐直军': (0.75, 1), '凌霄': (0.5, 3),
    #  '卡顿': (0.5, 1), '小海思': (0.75, 4), '高通': (0.5, 32)}, {'华为旗下': (1.0, 1), '达芬奇': (0.75, 1), '海思自研': (1.0, 1)},
    # {'WS5200': (1.5, 2), 'P6': (0.5, 2), 'Hi563x': (1.5, 2), 'IC': (0.5, 4), 'K3V1': (1.0, 2), 'WiFi': (1.0, 4),
    #  'P9': (0.5, 2), 'CPU': (0.75, 14), 'Qualcomm': (2.0, 2), 'Application-specific integrated circuit': (9.75, 1),
    #  'MTK': (0.75, 4), 'DVB': (0.75, 2), 'IPTV': (1.0, 2), 'NVR SoC': (1.75, 2), 'Mate': (1.0, 4), 'A4': (0.5, 2),
    #  '3G': (0.5, 2), 'EDA': (0.75, 4), 'GTI': (0.75, 2), 'USB': (0.75, 2), 'IP': (0.5, 4), 'SK': (0.5, 6),
    #  'Baseband': (2.0, 2), 'AI': (0.5, 2), 'Boudica': (1.75, 2), 'DVR SoC': (1.75, 2), 'ASIC': (1.0, 6),
    #  'Fabless': (1.75, 6), 'Pro': (0.75, 5), 'Foundry': (1.75, 4), 'Q2 Pro': (1.5, 1), 'C08': (0.75, 2),
    #  'DSP': (0.75, 2), 'MWC': (0.75, 2), 'AWE': (0.75, 2), 'Integrated Design and Manufacture': (8.25, 2),
    #  'Gartner': (1.75, 2), 'GPU': (0.75, 4), 'iPhone4': (1.75, 2), 'IoT': (0.75, 6), 'SSD': (0.75, 2),
    #  'Windows Mobile': (3.5, 2), 'gerber': (1.5, 2), 'NB-IoT': (1.5, 4), 'Android Authority': (4.25, 2),
    #  'ARM': (0.75, 24), 'PLC Turbo': (2.25, 2), 'vivo': (1.0, 3), 'K3': (0.5, 4), 'Arm PC': (1.5, 2),
    #  'EasyEDA': (1.75, 2), 'DVR': (0.75, 3), 'IPC SoC': (1.75, 2), 'arm': (0.75, 3), 'PCB': (0.75, 2), 'PK': (0.5, 2),
    #  'LTE Cat.11': (2.5, 1), 'OPPO': (1.0, 3), 'K3V2': (1.0, 6), 'IDM': (0.75, 6), 'ISP': (0.75, 4), 'SoC': (0.75, 14),
    #  'OMAP': (1.0, 2), 'mate9': (1.25, 2), 'Hi565x': (1.5, 2)},
    # ['中国台湾', '意大利', '深圳市', '美国', '法国', '安霸', '亚洲', '上海', '欧洲', '安卓', '韩国', '麒麟', '德州'],
    # {'德州仪器': (1.0, 3), '中央研究部': (1.25, 2), '联发科': (0.75, 3), '大华股份': (1.0, 2), '华为实验室': (1.25, 1), '华为麒麟': (1.0, 2),
    #  '中兴集成电路': (1.5, 1), '中兴之间': (1.0, 1), '华为': (0.5, 127), '英伟达': (0.75, 2), '三星': (0.5, 12), '韩国三星': (1.0, 1),
    #  '华为芯片': (1.0, 3), '华为终端公司': (1.5, 1), '深圳市海思半导体有限公司': (3.0, 1), '中兴': (0.5, 14), '海力士': (0.75, 1),
    #  '华为子母': (1.0, 1), '中国公司': (1.0, 1), '台积电': (0.75, 11), '华为海思': (1.0, 6), '海康威视': (1.0, 1), '三星电子': (1.0, 2),
    #  '英特尔': (0.75, 16), '芯片': (0.5, 2), '设计中心': (1.0, 1)})), (1791, (
    # {'任正非': (0.75, 10), '何庭波': (0.75, 3), '巴龙': (0.5, 3), '海思': (0.5, 10), '徐直军': (0.75, 1), '凌霄': (0.5, 3),
    #  '卡顿': (0.5, 1), '小海思': (0.75, 4), '高通': (0.5, 32), '高冬梅': (0.75, 2)},
    # {'华为旗下': (1.0, 1), '达芬奇': (0.75, 1), '文中兴': (0.75, 2), '海思自研': (1.0, 1)},
    # {'WS5200': (1.5, 2), 'P6': (0.5, 2), 'Hi563x': (1.5, 2), 'IC': (0.5, 4), 'K3V1': (1.0, 2), 'WiFi': (1.0, 4),
    #  'P9': (0.5, 2), 'CPU': (0.75, 14), 'Qualcomm': (2.0, 2), 'Application-specific integrated circuit': (9.75, 1),
    #  'MTK': (0.75, 4), 'DVB': (0.75, 2), 'IPTV': (1.0, 2), 'NVR SoC': (1.75, 2), 'Mate': (1.0, 4), 'A4': (0.5, 2),
    #  '3G': (0.5, 2), 'EDA': (0.75, 4), 'GTI': (0.75, 2), 'USB': (0.75, 2), 'IP': (0.5, 4), 'SK': (0.5, 6),
    #  'Baseband': (2.0, 2), 'AI': (0.5, 2), 'Boudica': (1.75, 2), 'DVR SoC': (1.75, 2), 'ASIC': (1.0, 6),
    #  'Fabless': (1.75, 6), 'Pro': (0.75, 5), 'Foundry': (1.75, 4), 'Q2 Pro': (1.5, 1), 'C08': (0.75, 2),
    #  'DSP': (0.75, 2), 'MWC': (0.75, 2), 'AWE': (0.75, 2), 'Integrated Design and Manufacture': (8.25, 2),
    #  'Gartner': (1.75, 2), 'GPU': (0.75, 4), 'iPhone4': (1.75, 2), 'IoT': (0.75, 4), 'SSD': (0.75, 2),
    #  'Windows Mobile': (3.5, 2), 'NB-IoT': (1.5, 4), 'Android Authority': (4.25, 2), 'ARM': (0.75, 24),
    #  'PLC Turbo': (2.25, 2), 'vivo': (1.0, 3), 'K3': (0.5, 4), 'Arm PC': (1.5, 2), 'DVR': (0.75, 3),
    #  'IPC SoC': (1.75, 2), 'arm': (0.75, 3), 'PK': (0.5, 2), 'LTE Cat.11': (2.5, 1), 'OPPO': (1.0, 3), 'K3V2': (1.0, 6),
    #  'IDM': (0.75, 6), 'ISP': (0.75, 4), 'SoC': (0.75, 14), 'OMAP': (1.0, 2), 'mate9': (1.25, 2), 'Hi565x': (1.5, 2)},
    # ['中国台湾', '意大利', '深圳市', '美国', '法国', '安霸', '亚洲', '上海', '欧洲', '安卓', '韩国', '麒麟', '德州'],
    # {'德州仪器': (1.0, 3), '中央研究部': (1.25, 2), '联发科': (0.75, 3), '大华股份': (1.0, 2), '华为实验室': (1.25, 1), '中兴集成电路': (1.5, 1),
    #  '华为麒麟': (1.0, 2), '中兴之间': (1.0, 1), '华为': (0.5, 128), '英伟达': (0.75, 2), '三星': (0.5, 12), '韩国三星': (1.0, 1),
    #  '华为芯片': (1.0, 1), '华为终端公司': (1.5, 1), '深圳市海思半导体有限公司': (3.0, 1), '中兴': (0.5, 12), '海力士': (0.75, 1),
    #  '华为子母': (1.0, 1), '中国公司': (1.0, 1), '台积电': (0.75, 11), '华为海思': (1.0, 6), '海康威视': (1.0, 1), '三星电子': (1.0, 2),
    #  '英特尔': (0.75, 16), '芯片': (0.5, 2), '设计中心': (1.0, 1)})), (1794, (
    # {'任正非': (0.75, 10), '何庭波': (0.75, 3), '巴龙': (0.5, 3), '海思': (0.5, 10), '徐直军': (0.75, 1), '凌霄': (0.5, 3),
    #  '卡顿': (0.5, 1), '小海思': (0.75, 4), '陈竺运': (0.75, 1), '高通': (0.5, 32), '高冬梅': (0.75, 2)},
    # {'华为旗下': (1.0, 1), '达芬奇': (0.75, 1), '海思自研': (1.0, 1)},
    # {'WS5200': (1.5, 2), 'P6': (0.5, 2), 'Hi563x': (1.5, 2), 'IC': (0.5, 4), 'K3V1': (1.0, 2), 'WiFi': (1.0, 4),
    #  'P9': (0.5, 2), 'CPU': (0.75, 14), 'C2': (0.5, 2), 'Qualcomm': (2.0, 2),
    #  'Application-specific integrated circuit': (9.75, 1), 'MTK': (0.75, 4), 'DVB': (0.75, 2), 'IPTV': (1.0, 2),
    #  'NVR SoC': (1.75, 2), 'Mate': (1.0, 4), 'A4': (0.5, 2), '3G': (0.5, 2), 'EDA': (0.75, 4), 'GTI': (0.75, 2),
    #  'USB': (0.75, 2), 'IP': (0.5, 4), 'SK': (0.5, 6), 'AR': (0.5, 2), 'Baseband': (2.0, 2), 'AI': (0.5, 2),
    #  'Boudica': (1.75, 2), 'DVR SoC': (1.75, 2), 'ASIC': (1.0, 6), 'Fabless': (1.75, 6), 'Pro': (0.75, 5),
    #  'Foundry': (1.75, 4), 'Q2 Pro': (1.5, 1), 'Apple Watch': (2.75, 2), 'C08': (0.75, 2), 'DSP': (0.75, 2),
    #  'MWC': (0.75, 2), 'AWE': (0.75, 2), 'Integrated Design and Manufacture': (8.25, 2), 'Gartner': (1.75, 2),
    #  'GPU': (0.75, 4), 'iPhone4': (1.75, 2), 'IoT': (0.75, 4), 'SSD': (0.75, 2), 'Windows Mobile': (3.5, 2),
    #  'NB-IoT': (1.5, 4), 'Android Authority': (4.25, 2), 'ARM': (0.75, 24), 'PLC Turbo': (2.25, 2), 'vivo': (1.0, 3),
    #  'K3': (0.5, 4), 'Arm PC': (1.5, 2), 'DVR': (0.75, 3), 'IPC SoC': (1.75, 2), 'arm': (0.75, 3), 'PK': (0.5, 2),
    #  'LTE Cat.11': (2.5, 1), 'OPPO': (1.0, 3), 'Surface': (1.75, 2), 'K3V2': (1.0, 6), 'IDM': (0.75, 6),
    #  'ISP': (0.75, 4), 'SoC': (0.75, 14), 'OMAP': (1.0, 2), 'mate9': (1.25, 2), 'Hi565x': (1.5, 2)},
    # ['中国台湾', '意大利', '深圳市', '美国', '法国', '阿里', '安霸', '亚洲', '上海', '欧洲', '安卓', '韩国', '麒麟', '德州'],
    # {'德州仪器': (1.0, 3), '中央研究部': (1.25, 2), '联发科': (0.75, 3), '大华股份': (1.0, 2), '华为实验室': (1.25, 1), '中兴集成电路': (1.5, 1),
    #  '华为麒麟': (1.0, 2), '中兴之间': (1.0, 1), '华为': (0.5, 128), '英伟达': (0.75, 2), '三星': (0.5, 12), '韩国三星': (1.0, 1),
    #  '华为芯片': (1.0, 1), '华为终端公司': (1.5, 1), '深圳市海思半导体有限公司': (3.0, 1), '中兴': (0.5, 14), '海力士': (0.75, 1),
    #  '华为子母': (1.0, 1), '中国公司': (1.0, 1), '搜狐号系': (1.0, 1), '台积电': (0.75, 11), '华为海思': (1.0, 6), '海康威视': (1.0, 1),
    #  '三星电子': (1.0, 2), '英特尔': (0.75, 16), '芯片': (0.5, 2), '国家电网阿里星球Surface陈竺运动手环智能手表': (6.25, 1), '设计中心': (1.0, 1)})), (
    #                 1801, ({'任正非': (0.75, 1), '高通': (0.5, 7), '巴龙': (0.5, 2), '孟晚舟': (0.75, 3), '海郡': (0.5, 2)},
    #                        {'多米诺': (0.75, 1), '云计算': (0.75, 3), '京东方': (0.75, 1), '大风号': (0.75, 2)},
    #                        {'SD58XX': (1.5, 2), 'AP': (0.5, 4), 'Qorvo': (1.25, 2), 'BasebandProcessor': (4.25, 2),
    #                         'OptiXtreme': (2.5, 2), 'SA': (0.5, 2), 'Modem': (1.25, 2), 'CPU': (0.75, 2),
    #                         'PS': (0.5, 2), 'WCDMA': (1.25, 2), 'IP': (0.5, 6), 'Tech': (1.0, 4), 'Insight': (1.75, 4),
    #                         'ID': (0.5, 4), 'BP': (0.5, 4), 'VS': (0.5, 2), 'IP Core': (1.75, 4), 'ASIC': (1.0, 2),
    #                         'FusionCube': (2.5, 2), 'GSM': (0.75, 2), 'App': (0.75, 2), 'NeoPhotonics': (3.0, 2),
    #                         'oDSP': (1.0, 2), 'Synopsys': (2.0, 3), 'Cadence': (1.75, 2), 'CDMA2000': (2.0, 2),
    #                         'ENP': (0.75, 2), 'Gartner': (1.75, 2), 'HI': (0.5, 2), 'GPU': (0.75, 2), 'Flex': (1.0, 2),
    #                         'IT': (0.5, 2), 'LG': (0.5, 3), 'ARM': (0.75, 5), 'Application Processor': (5.25, 2),
    #                         'Top20': (1.25, 6), 'Kirin': (1.25, 2), 'Intel': (1.25, 4), 'SD': (0.5, 2),
    #                         'SoC': (0.75, 2)},
    #                        ['美国明尼苏达', '温哥华', '之江', '中国', '日本', '德国', '浙江', '伊朗', '台湾', '英国', '韩国', '麒麟'],
    #                        {'华为公司': (1.0, 2), '沃达丰': (0.75, 2), '联发科': (0.75, 1), '美国明尼苏达大学': (2.0, 1),
    #                         '美国商务部': (1.25, 2), '华为海思自': (1.25, 1), '美国围堵华为': (1.5, 1), '德国电信': (1.0, 2),
    #                         '美国公司': (1.0, 1), '中央处理器': (1.25, 2), '华为': (0.5, 80), '华为VS中兴': (1.5, 1),
    #                         '新飞通等公司': (1.5, 2), '中国的电信设备': (1.75, 1), '中兴一样制裁华为': (2.0, 1), '美国半导体公司': (1.75, 1),
    #                         '雅虎': (0.5, 1), '中兴': (0.5, 28), '平板': (0.5, 1), '江丰电子': (1.0, 1), '之江实验室': (1.25, 1),
    #                         '新飞通光电': (1.25, 1), '中兴通讯公司': (1.5, 1), '华为中央软件研究院': (2.25, 1), '台积电': (0.75, 2),
    #                         '英国剑桥ARM公司': (2.25, 1), '浙江大学': (1.0, 1), '华为海思': (1.0, 4), '英特尔': (0.75, 2),
    #                         '美国': (0.5, 1)})), (1862, (
    # {'任正非': (0.75, 1), '高通': (0.5, 7), '巴龙': (0.5, 2), '孟晚舟': (0.75, 3), '海郡': (0.5, 1)},
    # {'多米诺': (0.75, 1), '京东方': (0.75, 1), '云计算': (0.75, 2)},
    # {'SD58XX': (1.5, 2), 'AP': (0.5, 4), 'Qorvo': (1.25, 2), 'BasebandProcessor': (4.25, 2), 'OptiXtreme': (2.5, 2),
    #  'SA': (0.5, 2), 'Modem': (1.25, 2), 'sendError': (2.25, 2), 'CPU': (0.75, 2), 'WCDMA': (1.25, 2), 'IP': (0.5, 5),
    #  'Tech': (1.0, 4), 'Insight': (1.75, 4), 'show': (1.0, 2), 'ID': (0.5, 2), 'BP': (0.5, 4), 'VS': (0.5, 2),
    #  'IP Core': (1.75, 2), 'ASIC': (1.0, 2), 'FusionCube': (2.5, 2), 'GSM': (0.75, 2), 'App': (0.75, 2),
    #  'NeoPhotonics': (3.0, 2), 'oDSP': (1.0, 2), 'CDMA2000': (2.0, 2), 'ENP': (0.75, 2), 'Gartner': (1.75, 2),
    #  'HI': (0.5, 2), 'GPU': (0.75, 2), 'Flex': (1.0, 2), 'IT': (0.5, 2), 'java.lang.IllegalStateException': (7.75, 2),
    #  'LG': (0.5, 3), 'ARM': (0.75, 5), 'Servlet Exception': (4.25, 1), 'Application Processor': (5.25, 2),
    #  'Top20': (1.25, 6), 'Kirin': (1.25, 2), 'Intel': (1.25, 2), 'SD': (0.5, 2),
    #  'forbidden after buffer hasbeen committed.Resin': (11.5, 2), 'SoC': (0.75, 2)},
    # ['温哥华', '之江', '美国', '中国', '日本', '德国', '伊朗', '英国', '韩国', '麒麟'],
    # {'华为公司': (1.0, 2), '沃达丰': (0.75, 2), '联发科': (0.75, 1), '美国商务部': (1.25, 2), '华为海思自': (1.25, 1), '美国围堵华为': (1.5, 1),
    #  '德国电信': (1.0, 2), '美国公司': (1.0, 1), '中央处理器': (1.25, 2), '华为': (0.5, 75), '华为VS中兴': (1.5, 1), '新飞通等公司': (1.5, 2),
    #  '中国的电信设备': (1.75, 1), '中兴一样制裁华为': (2.0, 1), '美国半导体公司': (1.75, 1), '中兴': (0.5, 28), '平板': (0.5, 1),
    #  '之江实验室': (1.25, 1), '新飞通光电': (1.25, 1), '华为海思': (1.0, 4), '剑桥ARM公司': (1.75, 1), '中兴通讯公司': (1.5, 1),
    #  '华为中央软件研究院': (2.25, 1), '雅虎': (0.5, 1), '英特尔': (0.75, 2), '美国': (0.5, 1)})), (1727, (
    # {'叶青': (0.5, 4), '很远': (0.5, 1), '戴辉': (0.5, 12), '李一男': (0.75, 1), '郑宝': (0.5, 1), '海思': (0.5, 3), '高达': (0.5, 1),
    #  '现华': (0.5, 1), '卡顿': (0.5, 1), '徐文伟': (0.75, 5), '艾伟': (0.5, 1), '刘丽丽': (0.75, 2), '高通': (0.5, 21),
    #  '何庭波': (0.75, 2), '博通': (0.5, 4), '任正非': (0.75, 28), '巴龙': (0.5, 5), '孟晚舟': (0.75, 1), '费劲': (0.5, 1),
    #  '刘平': (0.5, 2), '王劲火': (0.75, 2), '张利华': (0.75, 2), '大徐': (0.5, 3), '王劲': (0.5, 6), '程东升': (0.75, 2),
    #  '李征': (0.5, 5)}, {'斯达康': (0.75, 2), '亿利达': (0.75, 1)},
    # {'IPD': (0.75, 2), 'AP': (0.5, 2), 'CT2': (0.75, 2), 'K3V2E': (1.25, 2), 'K3V1': (1.0, 13), 'UT': (0.5, 3),
    #  'Little': (1.5, 2), 'JK1000': (1.5, 4), 'Huawei Silicon': (3.5, 2), 'System on Chip': (3.5, 2),
    #  'IPhone6': (1.75, 2), 'Baseband Processor': (4.5, 2), 'Turnkey GSM': (2.75, 2), 'BP': (0.5, 2), 'ASIC': (1.0, 2),
    #  'SD502': (1.25, 2), 'Mali-T628': (2.25, 2), 'ADI': (0.75, 3), 'C08': (0.75, 14), 'GPU': (0.75, 3),
    #  'Windows Mobile': (3.5, 2), 'ARM': (0.75, 6), 'Application Processor': (5.25, 2), 'Fellow': (1.5, 2),
    #  'CDMA': (1.0, 6), 'SD': (0.5, 6), 'K3V2': (1.0, 10), 'A7': (0.5, 2), 'DECT': (1.0, 8), 'SA': (0.5, 2),
    #  'P6': (0.5, 4), 'Broad Peak': (2.5, 2), 'D2': (0.5, 2), 'Mate7': (1.25, 14), 'GPU GC4000': (2.5, 1),
    #  '3G': (0.5, 6), 'WCDMA': (1.25, 2), 'EDA': (0.75, 4), 'K2': (0.5, 2), 'Mate': (1.0, 9), 'ISC': (0.75, 2),
    #  'Balong': (1.5, 2), 'Note4': (1.25, 2), 'HiSilicon': (2.25, 2), 'C08A': (1.0, 2), 'D1': (0.5, 2), 'GSM': (0.75, 5),
    #  'EAST8000': (2.0, 2), 'Neural-network Process Units': (7.0, 1), 'NPU': (0.75, 2), 'BH03': (1.0, 2),
    #  'ARMBig': (1.5, 1), 'BTS30': (1.25, 2), 'NB-loT': (1.5, 2), 'SD509': (1.25, 6), 'LTE FDD': (1.75, 2),
    #  'Image Signal Processor': (5.5, 2), 'K3': (0.5, 10), 'E220': (1.0, 2), 'TD-LTE': (1.5, 2), 'Option': (1.5, 2),
    #  'TI': (0.5, 6), 'BH01': (1.0, 2), 'Intel': (1.25, 3), 'ISP': (0.75, 2), 'SoC': (0.75, 2), 'A15': (0.75, 2)},
    # ['喀喇昆仑山布洛阿特峰', '珠穆朗玛峰', '深圳南油', '巴龙峰', '香港', '美国', '中国', '万门', '新研', '欧洲', '上海', '承东', '麒麟', '无锡'],
    # {'中研部': (0.75, 3), '中央研究部': (1.25, 1), '华为研发': (1.0, 2), '华为内部': (1.0, 1), '诺基亚西门子': (1.5, 2),
    #  '深圳南油深意工业大厦': (2.5, 1), '阿尔卡特朗讯': (1.5, 1), '仔细观察华为': (1.5, 1), '华为': (0.5, 158), '爱立信': (0.75, 5),
    #  '英伟达': (0.75, 2), '高通巴龙': (1.0, 2), '阿尔卡特': (1.0, 3), '三星': (0.5, 4), '中兴': (0.5, 16), '美国高通': (1.0, 1),
    #  '飞思卡尔': (1.0, 2), '搜狐号系': (1.0, 1), '华为海思': (1.0, 2), '斯达康': (0.75, 2), '华为要和AT&': (1.75, 1), '工程无锡华晶挖': (1.75, 1),
    #  '实验室': (0.75, 2), '华为数据卡': (1.25, 1)})), (1737, (
    # {'叶青': (0.5, 4), '很远': (0.5, 1), '李一男': (0.75, 1), '郑宝': (0.5, 1), '海思': (0.5, 3), '高达': (0.5, 1), '现华': (0.5, 1),
    #  '卡顿': (0.5, 1), '徐文伟': (0.75, 5), '艾伟': (0.5, 1), '高通': (0.5, 21), '何庭波': (0.75, 2), '博通': (0.5, 4),
    #  '任正非': (0.75, 23), '巴龙': (0.5, 5), '孟晚舟': (0.75, 1), '费劲': (0.5, 1), '王劲火': (0.75, 2), '大徐': (0.5, 3),
    #  '王劲': (0.5, 6), '李征': (0.5, 5)}, {'斯达康': (0.75, 2), '亿利达': (0.75, 1)},
    # {'IPD': (0.75, 2), 'AP': (0.5, 2), 'CT2': (0.75, 2), 'K3V2E': (1.25, 2), 'K3V1': (1.0, 13), 'UT': (0.5, 3),
    #  'Little': (1.5, 2), 'JK1000': (1.5, 4), 'Huawei Silicon': (3.5, 2), 'System on Chip': (3.5, 2),
    #  'IPhone6': (1.75, 2), 'Baseband Processor': (4.5, 2), 'Turnkey GSM': (2.75, 2), 'BP': (0.5, 2), 'ASIC': (1.0, 2),
    #  'SD502': (1.25, 2), 'Mali-T628': (2.25, 2), 'ADI': (0.75, 3), 'C08': (0.75, 14), 'GPU': (0.75, 3),
    #  'Windows Mobile': (3.5, 2), 'ARM': (0.75, 6), 'Application Processor': (5.25, 2), 'sohu': (1.0, 2),
    #  'Fellow': (1.5, 2), 'CDMA': (1.0, 6), 'SD': (0.5, 6), 'K3V2': (1.0, 10), 'A7': (0.5, 2), 'DECT': (1.0, 8),
    #  'SA': (0.5, 2), 'P6': (0.5, 4), 'Broad Peak': (2.5, 2), 'D2': (0.5, 2), 'Mate7': (1.25, 14),
    #  'GPU GC4000': (2.5, 1), '3G': (0.5, 6), 'WCDMA': (1.25, 2), 'EDA': (0.75, 4), 'K2': (0.5, 2), 'Mate': (1.0, 9),
    #  'ISC': (0.75, 2), 'Balong': (1.5, 2), 'Note4': (1.25, 2), 'HiSilicon': (2.25, 2), 'C08A': (1.0, 2), 'D1': (0.5, 2),
    #  'GSM': (0.75, 5), 'EAST8000': (2.0, 2), 'Neural-network Process Units': (7.0, 1), 'NPU': (0.75, 2),
    #  'BH03': (1.0, 2), 'ARMBig': (1.5, 1), 'BTS30': (1.25, 2), 'NB-loT': (1.5, 2), 'SD509': (1.25, 6),
    #  'LTE FDD': (1.75, 2), 'Image Signal Processor': (5.5, 2), 'K3': (0.5, 10), 'E220': (1.0, 2), 'TD-LTE': (1.5, 2),
    #  'Option': (1.5, 2), 'TI': (0.5, 6), 'BH01': (1.0, 2), 'Intel': (1.25, 3), 'ISP': (0.75, 2), 'SoC': (0.75, 2),
    #  'A15': (0.75, 2)},
    # ['喀喇昆仑山布洛阿特峰', '珠穆朗玛峰', '深圳南油', '巴龙峰', '香港', '美国', '中国', '万门', '新研', '欧洲', '上海', '承东', '麒麟', '无锡'],
    # {'中研部': (0.75, 3), '中央研究部': (1.25, 1), '华为内部': (1.0, 1), '诺基亚西门子': (1.5, 2), '深圳南油深意工业大厦': (2.5, 1),
    #  '阿尔卡特朗讯': (1.5, 1), '仔细观察华为': (1.5, 1), '华为': (0.5, 149), '爱立信': (0.75, 5), '英伟达': (0.75, 2), '高通巴龙': (1.0, 2),
    #  '阿尔卡特': (1.0, 3), '三星': (0.5, 4), '中兴': (0.5, 16), '美国高通': (1.0, 1), '飞思卡尔': (1.0, 2), '华为海思': (1.0, 1),
    #  '华为芯片麒麟': (1.5, 1), '斯达康': (0.75, 2), '华为要和AT&': (1.75, 1), '工程无锡华晶挖': (1.75, 1), '实验室': (0.75, 2),
    #  '华为数据卡': (1.25, 1)}))]
    #
    # weight_xigam_id_tp_li = []
    # for ev_tp in words_detail:
    #     weight_xigam = 0
    #     ev_dic = ev_tp[1][0]
    #     for ev_wd in words:
    #         try:
    #             weight_xigam += ev_dic[ev_wd][0]*ev_dic[ev_wd][1]
    #         except Exception as te:
    #             continue
    #     weight_xigam_id_tp_li.append((ev_tp[0],weight_xigam))
    # weight_xigam_id_tp_li = sorted(weight_xigam_id_tp_li, key=lambda x: x[1], reverse=True)
    # print(weight_xigam_id_tp_li)
    with open('result___.pkl', 'rb') as f:
        result = pickle.load(f)
        print()
    # relation = deal_relation(result[2][1])
    # print(relation)
    people_list = []
    people_info_words = result[2][8]
    maj_event = result[2][0]
    print(maj_event)
    final_maj_event = []
    for i in maj_event:
        people_pic = []
        if not i[1]:
            continue
        for people in i[1]:
            if not people in people_list:
                has_pic = False
                image_result = func(people)
                for j in image_result:
                    pic = j[0]
                    html = j[1]
                    for word in result[2][8][people]:
                        if word in html:
                            people_pic.append(pic)
                            has_pic = True
                            people_list.append(people)
                            break
                    if has_pic:
                        break
        i = list(i)
        i[1] = people_pic
        final_maj_event.append(i)
    print()
